# NetworkCommunicationException Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NetworkCommunicationException Class
Members See Also
---
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class NetworkCommunicationException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class NetworkCommunicationException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class NetworkCommunicationException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..NetworkCommunicationException
# See Also
NetworkCommunicationException Members
Autodesk.Revit.Exceptions Namespace